{"meta":{"title":"孤狼博客","subtitle":"生命不息，折腾不止","description":"生命不息，折腾不止","author":"Eric","url":"http://lonewolferic.github.io"},"pages":[{"title":"About Me","date":"2018-09-02T06:50:46.000Z","updated":"2018-09-02T14:47:02.227Z","comments":true,"path":"about/index.html","permalink":"http://lonewolferic.github.io/about/index.html","excerpt":"","text":"四川大学某菜鸡工科狗 会一点点嵌入式，会一点点电路，会一点点python，会一点点linux 写不出代码，de不出bug，转不动电机 喜欢搞机，喜欢造人工智障 热爱健身，喜爱摄影 想学很多东西，以前觉得读到双博士才能学完想学的，现在发现自己的智商根本不配读大学 直男癌晚期，没救了 有的时候会有很多奇妙的想法，但……就是因为自己太菜了实现不了 唔……反正就是很菜 联系方式：871855626@qq.com"},{"title":"","date":"2018-09-02T08:31:04.231Z","updated":"2018-09-02T08:20:47.797Z","comments":true,"path":"img/pexels/README.html","permalink":"http://lonewolferic.github.io/img/pexels/README.html","excerpt":"","text":"Pexels pictures License https://www.pexels.com/photo-license/ It’s hard to understand complex licenses that is why all photos on Pexels are licensed under the Creative Commons Zero (CC0) license. This means the pictures are completely free to be used for any legal purpose. The pictures are free for personal and even for commercial use. You can modify, copy and distribute the photos. All without asking for permission or setting a link to the source. So, attribution is not required. The only restriction is that identifiable people may not appear in a bad light or in a way that they may find offensive, unless they give their consent. You should also make sure the depicted content (people, logos, private property, etc.) is suitable for your application and doesn’t infringe any rights. The CC0 license was released by the non-profit organization Creative Commons (CC). Get more information about Creative Commons images and the license on the official license page. CC0 1.0 UniversalOfficial translations of this legal tool are available in other languages. CREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE LEGAL SERVICES. DISTRIBUTION OF THIS DOCUMENT DOES NOT CREATE AN ATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS INFORMATION ON AN &quot;AS-IS&quot; BASIS. CREATIVE COMMONS MAKES NO WARRANTIES REGARDING THE USE OF THIS DOCUMENT OR THE INFORMATION OR WORKS PROVIDED HEREUNDER, AND DISCLAIMS LIABILITY FOR DAMAGES RESULTING FROM THE USE OF THIS DOCUMENT OR THE INFORMATION OR WORKS PROVIDED HEREUNDER. Statement of Purpose The laws of most jurisdictions throughout the world automatically confer exclusive Copyright and Related Rights (defined below) upon the creator and subsequent owner(s) (each and all, an “owner”) of an original work of authorship and/or a database (each, a “Work”). Certain owners wish to permanently relinquish those rights to a Work for the purpose of contributing to a commons of creative, cultural and scientific works (“Commons”) that the public can reliably and without fear of later claims of infringement build upon, modify, incorporate in other works, reuse and redistribute as freely as possible in any form whatsoever and for any purposes, including without limitation commercial purposes. These owners may contribute to the Commons to promote the ideal of a free culture and the further production of creative, cultural and scientific works, or to gain reputation or greater distribution for their Work in part through the use and efforts of others. For these and/or other purposes and motivations, and without any expectation of additional consideration or compensation, the person associating CC0 with a Work (the “Affirmer”), to the extent that he or she is an owner of Copyright and Related Rights in the Work, voluntarily elects to apply CC0 to the Work and publicly distribute the Work under its terms, with knowledge of his or her Copyright and Related Rights in the Work and the meaning and intended legal effect of CC0 on those rights. Copyright and Related Rights. A Work made available under CC0 may be protected by copyright and related or neighboring rights (“Copyright and Related Rights”). Copyright and Related Rights include, but are not limited to, the following: the right to reproduce, adapt, distribute, perform, display, communicate, and translate a Work; moral rights retained by the original author(s) and/or performer(s); publicity and privacy rights pertaining to a person’s image or likeness depicted in a Work; rights protecting against unfair competition in regards to a Work, subject to the limitations in paragraph 4(a), below; rights protecting the extraction, dissemination, use and reuse of data in a Work; database rights (such as those arising under Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, and under any national implementation thereof, including any amended or successor version of such directive); and other similar, equivalent or corresponding rights throughout the world based on applicable law or treaty, and any national implementations thereof. Waiver. To the greatest extent permitted by, but not in contravention of, applicable law, Affirmer hereby overtly, fully, permanently, irrevocably and unconditionally waives, abandons, and surrenders all of Affirmer’s Copyright and Related Rights and associated claims and causes of action, whether now known or unknown (including existing as well as future claims and causes of action), in the Work (i) in all territories worldwide, (ii) for the maximum duration provided by applicable law or treaty (including future time extensions), (iii) in any current or future medium and for any number of copies, and (iv) for any purpose whatsoever, including without limitation commercial, advertising or promotional purposes (the “Waiver”). Affirmer makes the Waiver for the benefit of each member of the public at large and to the detriment of Affirmer’s heirs and successors, fully intending that such Waiver shall not be subject to revocation, rescission, cancellation, termination, or any other legal or equitable action to disrupt the quiet enjoyment of the Work by the public as contemplated by Affirmer’s express Statement of Purpose. Public License Fallback. Should any part of the Waiver for any reason be judged legally invalid or ineffective under applicable law, then the Waiver shall be preserved to the maximum extent permitted taking into account Affirmer’s express Statement of Purpose. In addition, to the extent the Waiver is so judged Affirmer hereby grants to each affected person a royalty-free, non transferable, non sublicensable, non exclusive, irrevocable and unconditional license to exercise Affirmer’s Copyright and Related Rights in the Work (i) in all territories worldwide, (ii) for the maximum duration provided by applicable law or treaty (including future time extensions), (iii) in any current or future medium and for any number of copies, and (iv) for any purpose whatsoever, including without limitation commercial, advertising or promotional purposes (the “License”). The License shall be deemed effective as of the date CC0 was applied by Affirmer to the Work. Should any part of the License for any reason be judged legally invalid or ineffective under applicable law, such partial invalidity or ineffectiveness shall not invalidate the remainder of the License, and in such case Affirmer hereby affirms that he or she will not (i) exercise any of his or her remaining Copyright and Related Rights in the Work or (ii) assert any associated claims and causes of action with respect to the Work, in either case contrary to Affirmer’s express Statement of Purpose. Limitations and Disclaimers. No trademark or patent rights held by Affirmer are waived, abandoned, surrendered, licensed or otherwise affected by this document. Affirmer offers the Work as-is and makes no representations or warranties of any kind concerning the Work, express, implied, statutory or otherwise, including without limitation warranties of title, merchantability, fitness for a particular purpose, non infringement, or the absence of latent or other defects, accuracy, or the present or absence of errors, whether or not discoverable, all to the greatest extent permissible under applicable law. Affirmer disclaims responsibility for clearing rights of other persons that may apply to the Work or any use thereof, including without limitation any person’s Copyright and Related Rights in the Work. Further, Affirmer disclaims responsibility for obtaining any necessary consents, permissions or other rights required for any use of the Work. Affirmer understands and acknowledges that Creative Commons is not a party to this document and has no duty or obligation with respect to this CC0 or use of the Work."}],"posts":[{"title":"Hexo博客markdown文件图片路径自动处理脚本","slug":"auto-blog-img-path-process","date":"2018-09-05T04:20:36.000Z","updated":"2018-09-05T05:05:40.236Z","comments":true,"path":"2018/09/05/auto-blog-img-path-process/","link":"","permalink":"http://lonewolferic.github.io/2018/09/05/auto-blog-img-path-process/","excerpt":"","text":"问题描述Hexo博客通过markdown文件来生成html文件。而我们的博客中经常会插入图片，如何方便的让插入的图片经过渲染之后正确的现实在网页上是我们要解决的问题。 传送门：hexo博客的图片解决方法 这里的方案可以在hexo new post的时候产生一个文件夹，并且在hexo g的时候自动关联图片文件夹和md文件。但是我们在写博客的时候插入图片一般是直接将图片拖入typora中，这样留下的图片路径是绝对路径，但是hexo编译需要我们的图片路径是相对路径才可以正确现实图片。那么怎么整呢？每次拖进去之后切换源码模式然后自己删路径？不不不不，像我们这么聪（lan）明（duo）的人，肯定是要用自动的方式来解决这个问题。 于是就有了这么一个脚本，主要工作思路就是找到带有图片的文章（有同名的文件夹），然后打开文章，用正则表达式寻找图片链接，然后删除前面的路径，只剩下相对路径。 使用方法配置详细方法在上面的链接中。这里就讲一个注意点： hexo的_config.yml这里的配置 1post_asset_folder: true 执行来到_Post的目录下，运行python代码： 1python turn.py 大功告成 源码12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455565758596061626364import osimport reclass Article: def __init__(self, name): self.name = name self.dir = name.strip('.md') # print(self.name) # print(self.dir) def run(self): f = open(self.name, 'r', encoding='UTF-8') f_new = open(self.name + '.new', 'w', encoding='UTF-8') print('正在修改' + self.name + '的图片路径') lines = f.readlines() for line in lines: picture_path = re.findall(r'!\\[.&#123;0,100&#125;\\]\\(.&#123;0,10000&#125;\\)', line) # print(line) if picture_path: picture_path = picture_path[0] # print(picture_path) new_path = picture_path[0 : picture_path.index('(') + 1] + picture_path[picture_path.index(self.dir) : ] + '\\r\\n' #print(new_path) f_new.write(new_path) else: f_new.write(line) f.close() f_new.close() # 换文件 os.remove(self.name) os.rename(self.name + '.new', self.name) print('修改完毕')def main(): article_list = [] dir_list = [] article_with_picture_list = [] files = os.listdir('.') # print(files) for f in files: if '.md' in f: article_list.append(f) elif '.' not in f: dir_list.append(f) # print(article_list) # print(dir_list) for dir in dir_list: for article in article_list: if dir in article: article_with_picture_list.append(article) print('查询到本目录下有以下文章的图片路径需要修改：') for article_with_picture in article_with_picture_list: print(article_with_picture) # 执行转换 for article_with_picture in article_with_picture_list: article = Article(article_with_picture) article.run() print('谢谢使用')if __name__ == \"__main__\": main()","categories":[{"name":"Python","slug":"Python","permalink":"http://lonewolferic.github.io/categories/Python/"}],"tags":[{"name":"技术","slug":"技术","permalink":"http://lonewolferic.github.io/tags/技术/"},{"name":"python","slug":"python","permalink":"http://lonewolferic.github.io/tags/python/"}]},{"title":"学傻了的对话（不定时更新）","slug":"study-to-death","date":"2018-06-30T16:00:00.000Z","updated":"2018-09-02T14:35:42.303Z","comments":true,"path":"2018/07/01/study-to-death/","link":"","permalink":"http://lonewolferic.github.io/2018/07/01/study-to-death/","excerpt":"","text":"芝士就是力量！ 和张大仙一起去校外吃铁板烧，他先把选好的菜给老板，我后给，结果我的铁板烧先烧好。 张：为什么你在我之后给的，结果先烧好了？ 我：也许他们是用堆栈烧饭的吧！ 高大佬又双叒叕在说自己要学不完了 （空间） 我：我也要学不完了 高：大佬说笑了，你们各个都考的比我高 我：上学期成绩谁好你心里有点ACD数 高：上学期关这学期什么事 我：你以为你是非因果系统啊！（这里其实说错了，暴露学渣本质了……） 詹：因果LTI 我：不对这个应该是记忆系统……","categories":[{"name":"Others","slug":"Others","permalink":"http://lonewolferic.github.io/categories/Others/"}],"tags":[{"name":"杂谈","slug":"杂谈","permalink":"http://lonewolferic.github.io/tags/杂谈/"}]},{"title":"关于单片机初始化的注意事项","slug":"a-bug-about-microcontroller-initalization","date":"2018-06-16T16:00:00.000Z","updated":"2018-09-05T04:55:48.784Z","comments":true,"path":"2018/06/17/a-bug-about-microcontroller-initalization/","link":"","permalink":"http://lonewolferic.github.io/2018/06/17/a-bug-about-microcontroller-initalization/","excerpt":"","text":"为了让单片机完成我们所需的功能，我们每次都会使用到很多的外设，并且在控制系统中，为了保证控制的时效性，有一个专门的定时器来产生中断，进入控制环——controlloop，在主函数的循环中则放入不痛不痒的程序——led闪烁之类的。一个标准的单片机程序流程为：初始化各个外设，进入while(1)循环，定时器定时产生中断，在中断中，完成控制任务，回到while(1)，再进入下一个中断，解算姿态……以此循环往复。（本程序中TIM14产生定时中断） 在外设数量较多，并有可能又要添加新外设的情况下，我们通常使用BSP（board support package ，板级支持包 ）来管理外设。主要的好处是不用每次添加新外设的时候在每个外设的程序前面去包含新的外设头文件。 所以我们的程序一般就变成了这样。 bsp_Init中初始化全部外设。 这看起来是一个没问题的程序，但是实际运行的时候，却跑不起来。 BUG在哪里呢？bug在于初始化的顺序，以上面的程序为例，运行之后发现程序卡住了，进入debug发现程序卡死在这里，这是干什么用的呢？printf的发送程序，等待发送完成的信号。为什么没等到发送完成呢？因为串口都还没初始化啊！ 正常的程序，运行流程图应该是这样的： 这个错误的程序，运行流程图是这样的：（外设2依然会初始化完成，但在如果在还没初始化完成的时候就进入中断，就会出现问题） 问题出现在，控制程序controlloop是肯定要用到外设的——串口，ADC之类的。如果过早进入定时器中断，外设还未初始化完成，就会出现程序轮询一直等相应的情况——等待串口数据发送完成，等待ADC采样完成（程序卡死一般都是因为while(xx == 1)这句等待而导致的）。但是其实根本没法完成，因为这些还没开机初始化呢。 所以，在单片机程序中，产生定时器定时中断的timer必须放在最后初始化。如下图所示：","categories":[{"name":"Embedded","slug":"Embedded","permalink":"http://lonewolferic.github.io/categories/Embedded/"}],"tags":[{"name":"嵌入式","slug":"嵌入式","permalink":"http://lonewolferic.github.io/tags/嵌入式/"}]},{"title":"纪念第一次参加技术类比赛：船模大赛","slug":"my-first-model-boat-race","date":"2018-05-15T16:00:00.000Z","updated":"2018-09-05T04:55:48.784Z","comments":true,"path":"2018/05/16/my-first-model-boat-race/","link":"","permalink":"http://lonewolferic.github.io/2018/05/16/my-first-model-boat-race/","excerpt":"","text":"做个船模比赛心好累 前期调试 比赛前三周开始调模块，主控芯片采用stm32f407，通讯采用蓝牙串口模块，没用24L01的原因是……没调出来；电机采用2212无刷电机。不得不说，在所有的模块调试里面，通讯是最麻烦的：电机、舵机、两路ADC花了半天就调好了，通讯调了一天半。 看似把模块组合在一起很简单，但这就是硬件玄学的地方。 初赛 爆肝调船！由于之前没有调过无刷电机（抱歉菜到大家了），一直不知道怎么对频。还是靠着电子科技园的陈大佬带我学会了对频。整个船差不多多能跑起来已经是比赛前一天下午了。但是还是有bug-通讯卡死问题。 bug没调完，那怎么办呢？当然是熬夜爆肝调啦！ 收拾下桌子开始干活！ 不得不说，ddl是第一生产力，一个晚上让船的电机舵机联调成功，使用暴力手段解决了通讯卡死问题，调完了一套备用的蓝牙串口模块（HC-12） 然而……第二天比赛却因为下雨而推迟了一天…….迟了一天…….了一天…….一天…….天……. 本来多了一天，以为能让船下水的，结果出现了电机无法调速的bug，在调试的时候把电池电用光了，而且电池被我们榨干用坏了，充不进去电。队友小姐姐就跑出去买电池了。 下水比赛当天才是第一次下水，上午评完外观分（我们的船叫Aurora，嘻嘻），下午我们自己试船（离比赛开始只有4h）。 没做过船模，不了解电机性能，第一次试的时候，舵机初始化的时候是歪的，h2212的动力太大，我自己操作也不熟悉，推动摇杆，船直接飞了出去。船飞到岸上，把自己的肚子撞裂了……（韵阳小姐姐抱起我们的船跑回去修） 简单地用热熔胶糊上了裂口处，我们的船又下水了，为了防止船出bug，我们给船装上了安全绳：当船动不了的时候还可以手动把船拉回来。然后一出船，舵机方向还是没摆正，水中乱绕了几圈之后不动了。这时！安全绳的作用就体现了出来。可是不拉不要紧，一拉，由于船受到的是侧面的力，我们的Aurora直接侧翻倒在了水中…… 翻船了之后我们以最快的速度把船拉了回来（电子元件在通电的情况下进水是大忌！），但还是晚了一步。蓝牙的灯已经不亮了，烧模块了哇！但是我还有前面一次调完的HC-12模块，但当时由于卡死问题更严重，所以没有使用。当时情况紧急，心态有点乱，本来也是有HC-05的，但是AT指令输进去之后没有配对成功，心态爆炸。这时也只能死马当活马医了，换上了新的通讯模块之后，电机不转了…… 电机不转也可以说是电调的问题，本来在设置满油门的时候需要设置初始化，设置完一次之后就不用再设置了，但现在每次掉电之后都需要重新设置油门量程。 H2212实在是太强劲了，就跟脱缰的野马一样，速度太快，完全控制不住。这种比赛比的是稳定性，所以临时换电机，换成了动力较弱的A2212电机。 缝缝补补总算是把下水发现的问题全改了。 赛场 一直没时间去解决的是遥控器的电源问题，为了解决这个问题，本项目组采用了“基于surface pro3的船模遥控系统”。好吧，其实就是用电脑的usb供电。 作为一个操作手，我的练习时间还是太少了，但是我们的船跑的慢啊，按错一个键也没啥关系，往回拉就没事了。初赛只是想苟过去，最后的晋级名单也验证了我的想法－所有跑完赛道的船全都进决赛了。 决赛先是用两块3.7v电池和5v稳压模块解决了遥控器供电的问题（总算不用抱着电脑开船了），然后莫名奇妙的就调好了H2212电机和电调，但是在之后某次调船的时候电调进水烧掉了。 这个时候船主要的问题就是通信，蓝牙通信实在太不稳定，距离太近了，淘宝界面说的500+m都没问题，实际跑起来10m撑死。导致我们调船的时候经常出现船跑到一半停湖中间了，然后我就脱鞋赤脚下去捞…… 电调烧了之后电机和电调就莫名其妙的没法跑了，我也是头铁，不撞南墙不回头。但是无刷电机还是没有调出来。直到赛前一天才打算临时换方案：使用775有刷电机作为动力源，还好配套的联轴器。 实验室里现场改代码，但是一个引脚的pwm波总是出不来，但没有什么好的调试方法–我根本没法知道波形到底出来没有。so我们把电子科技园的示波器搬回了寝室！（最后是发现高级定时器初始化的时候还要对于pwm使能多配置一个东西） 临时改方案当然是要通宵改了，为了防止自己躺床上起不来但又想睡觉只能这样做了： 所以当时下午3点比赛，上午还要进行技术测评，测评完就来到极客邦调，无法解决有刷电机的调速问题，于时用示波器来看去驱动板输出波形，结果不小心探头抖了一下，然后就…… 决赛赛场赛前发现船转向速度有点慢，然后……校园卡就决定是你了！ 由于是临时换的电机，也没有电机固定支架之类的，所以就只能用胶带勉强固定一下。 为了测试电机有没有转反，我和两位小姐姐进了女厕用厕所里洗手盆的水测试转反没有，中途又有另一位小姐姐进来，看到我在里面，那场面…… 开船的时候嘛emmmmm船前半段跑的好好的，结果跑到一半船没法跑了，动了下舵机的功能，发现能动，那就是电机的问题了。喊了船爹妈之后终于是动了起来，但是船就是动一下然后停很久。但最后也总算是跑完了全程。 还有一次重赛的机会，知道船出了问题之后下来立马对船进行抢修，一看驱动板烧了，开始换驱动板，可惜焊锡和驱动板的大端口质量不好也没装上去。 最后发现其实是胶带的锅，胶带固定的不牢，电机转动的时候把胶带卷进去了，然后电机长时间堵转，导致驱动板烧毁。 其他 做了比赛才知道自己有多么的菜，但是反观这个比赛，我们发现基础功能才是最重要的，初赛的时候只要是能跑的船就能进决赛，决赛专业组也是只要跑完全程就能有奖。","categories":[{"name":"Embedded","slug":"Embedded","permalink":"http://lonewolferic.github.io/categories/Embedded/"}],"tags":[{"name":"嵌入式","slug":"嵌入式","permalink":"http://lonewolferic.github.io/tags/嵌入式/"},{"name":"控制","slug":"控制","permalink":"http://lonewolferic.github.io/tags/控制/"},{"name":"比赛","slug":"比赛","permalink":"http://lonewolferic.github.io/tags/比赛/"}]},{"title":"Hello World","slug":"hello-world","date":"2018-04-29T16:00:00.000Z","updated":"2018-09-02T14:33:49.597Z","comments":true,"path":"2018/04/30/hello-world/","link":"","permalink":"http://lonewolferic.github.io/2018/04/30/hello-world/","excerpt":"","text":"个人博客上线啦！ 我是谁?&emsp;&emsp;四川大学电气信息学院的大二本科生，自我介绍什么的，About里面都有 为什么开始写博客?&emsp;&emsp;主要是为了不让自己太颓啦，最近实在是太咸鱼了。开个博客，给自己点动力和压力，摆脱咸鱼的处境 &emsp;&emsp;其次也是想好好记录一下自己的生活，自己做东西的经验，对人生的看法之类的 &emsp;&emsp;还有就是羡慕各位大佬都有自己的网站，羡慕嫉妒恨，所以我也搞一个，哼～ 为什么要叫孤狼?&emsp;&emsp;孤狼，意为桀骜不训，永不低头。向往着真理与正义，却又承受着自我求索的孤寂。独行，却不孤寂；狂野，却又不无情。 &emsp;&emsp;好吧，以上内容皆为扯淡，孤狼的真正含义是这样的：来跟我读：孤(single)狼(dog) &emsp;&emsp;觉得叫“孤狼”不顺口叫“表表”也行 为什么不去开公众号?&emsp;&emsp;如果开了微信公众号，由于爸妈用的都是微信，so～想像一个场景：我爸打开微信，看到自己儿子的公众号又出了一篇新文章，他打开一看，儿子又烧了一块板子，嗯～这次经验总结的很好。然后就转发到自己的朋友圈（日常秀娃）下面的评论区就会出现各种emmmm……你们懂的。尴尬癌都要犯了……. &emsp;&emsp;其实也还有其他原因，YY硕的文章里告诉我们可以去学点html，css，javascript，最好的练习方式就是去帮别人写网站，但……没人要我帮忙写！？那就给自己写过个呗。顺便练练web编程（其实使用jekyll框架 + 模板也没练多少编程，但是！有个个人网站感觉很geek啊！） 其他&emsp;&emsp;更新频率？布吉岛，看心情更新，努力做到一月一更吧 &emsp;&emsp;每篇博文都有评论功能，大家有啥想法可以评论哈，禁止乱膜陆大佬（陆大佬是谁？喵喵瞄？）","categories":[{"name":"Others","slug":"Others","permalink":"http://lonewolferic.github.io/categories/Others/"}],"tags":[{"name":"杂谈","slug":"杂谈","permalink":"http://lonewolferic.github.io/tags/杂谈/"}]}]}